## ***Advent of Code 2024 - Day 01***

### Step 1 - Input data

In [40]:
# Input the dataset from a text file
import pandas as pd
import numpy as np

df = pd.read_csv('input.txt', delimiter='\t', header=None)
df.head()

               0
0  76569   66648
1  38663   66530
2  60350   60777
3  35330   13469
4  88681   66648

***Observation***

Each row is list of string with 02 numbers, separated by 02 blank spaces. I'd need to come up with a function which:
- input: string
- split into 02 values, then each values are converted to integer
- return a list with 02 values

In [41]:
# split and convert function
def split_convert(x):
    return [int(i) for i in x.split('  ')]

In [42]:
# Apply split_convert function on the df.
df[['col1', 'col2']] = df[0].apply(split_convert).tolist()
df.head()

               0   col1   col2
0  76569   66648  76569  66648
1  38663   66530  38663  66530
2  60350   60777  60350  60777
3  35330   13469  35330  13469
4  88681   66648  88681  66648

In [44]:
# Arrange new col1 & col2 in descending order
df['col1'] = df['col1'].sort_values().values
df['col2'] = df['col2'].sort_values().values
df.head()

               0   col1   col2
0  76569   66648  10053  10004
1  38663   66530  10073  10076
2  60350   60777  10269  10099
3  35330   13469  10341  10197
4  88681   66648  10463  10480

In [45]:
# New column with total distance with abs between col1 & col2
df['distance'] = abs(df['col1'] - df['col2'])
df.head()

               0   col1   col2  distance
0  76569   66648  10053  10004        49
1  38663   66530  10073  10076         3
2  60350   60777  10269  10099       170
3  35330   13469  10341  10197       144
4  88681   66648  10463  10480        17

In [46]:
#Total distancce
df['distance'].sum()

3246517